In [124]:
import numpy as np 
import pandas as pd

In [125]:
df_date = pd.read_csv('orders.csv')
df_time = pd.read_csv('messages.csv')

In [126]:
df_date.sample(5)

           date  product_id  city_id  orders
622  2018-09-21        3234       25       2
736  2018-12-23        1365       26       1
610  2018-10-01         457       16       2
641  2019-08-12        3034        0       1
635  2018-11-11        6295        3      84

In [127]:
df_time.sample(5)

                    date                                                msg
5    2016-03-08 22:52:00  пар.32прок.дев.на авто по ночн.городу.Днепр.06...
12   2013-06-05 01:05:00                     .эксперементаторше. 0678676246
924  2015-11-21 00:03:00  ПАРЕНЬ ОБМЕН ФОТО С ПАРНЕМ 0963531597ПЕРВЫЙ НЕШЛЮ
719  2012-09-18 01:06:00                                 931251045 ДЕВЧОНКИ
920  2014-05-31 00:05:00  д скучяет парни 25-30 звоните0638100702 адмим ...

In [128]:
df_date['date'] = pd.to_datetime(df_date['date'])

In [129]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [130]:
df_date['year'] = df_date['date'].dt.year
df_date.sample(5)

          date  product_id  city_id  orders  year
732 2019-08-15        5143       16       2  2019
908 2019-01-20        7510       16       2  2019
734 2018-12-21        1557       30       1  2018
785 2019-11-28        7427       28       1  2019
90  2019-12-16        7491       13       1  2019

In [131]:
df_date['Month'] = df_date['date'].dt.month
df_date['Month_name'] = df_date['date'].dt.month_name()
df_date.sample(5)

          date  product_id  city_id  orders  year  Month Month_name
843 2019-02-14        4627       26       5  2019      2   February
617 2019-06-27        5517       22       4  2019      6       June
820 2019-07-27        7239       22       2  2019      7       July
953 2018-11-24        1848       14     120  2018     11   November
703 2019-08-02        5187       22       4  2019      8     August

In [132]:
df_date['Day'] = df_date['date'].dt.day
df_date['Day_name'] = df_date['date'].dt.day_name()
df_date.sample(5)

,date,product_id,city_id,orders,year,Month,Month_name,Day,Day_name
366,2019-07-22,2307,4,6,2019,7,July,22,Monday
460,2019-01-25,5508,14,9,2019,1,January,25,Friday
172,2019-06-24,5450,13,1,2019,6,June,24,Monday
219,2019-07-26,4425,16,2,2019,7,July,26,Friday
813,2019-06-12,12,25,1,2019,6,June,12,Wednesday

In [133]:
df_time['date'] = pd.to_datetime(df_time['date'])

In [134]:
df_time['Time'] = df_time['date'].dt.time
df_time['Hours'] = df_time['date'].dt.hour
df_time['Minutes'] = df_time['date'].dt.minute
df_time['Seconds'] = df_time['date'].dt.second
df_time = df_time.drop(columns='msg')
df_time.sample(5)

                   date      Time  Hours  Minutes  Seconds
576 2015-03-08 23:05:00  23:05:00     23        5        0
703 2014-01-09 23:08:00  23:08:00     23        8        0
78  2013-11-11 00:20:00  00:20:00      0       20        0
413 2013-08-29 00:48:00  00:48:00      0       48        0
706 2012-03-06 23:55:00  23:55:00     23       55        0

In [137]:
import datetime
today = datetime.datetime.today()

In [139]:
today-df_time['date']

0     3721 days 20:03:12.393984
1     3585 days 21:13:12.393984
2     4071 days 20:32:12.393984
3     3373 days 20:22:12.393984
4     3770 days 21:42:12.393984
                 ...
995   4360 days 20:03:12.393984
996   3681 days 21:39:12.393984
997   4146 days 21:16:12.393984
998   4262 days 21:19:12.393984
999   3534 days 21:28:12.393984
Name: date, Length: 1000, dtype: timedelta64[ns]

In [141]:
(today - df_date['date']).dt.days

0      1535
1      2017
2      1948
3      1650
4      1873
       ...
995    1963
996    1904
997    1752
998    1817
999    1591
Name: date, Length: 1000, dtype: int64

In [142]:
# in seconds

(today - df_time['date'])/np.timedelta64(1,'s')

0      3.215666e+08
1      3.098204e+08
2      3.518083e+08
3      2.915005e+08
4      3.258061e+08
           ...
995    3.767762e+08
996    3.181164e+08
997    3.582910e+08
998    3.683136e+08
999    3.054149e+08
Name: date, Length: 1000, dtype: float64

In [143]:
# in minutes

(today - df_time['date'])/np.timedelta64(1,'m')

0      5.359443e+06
1      5.163673e+06
2      5.863472e+06
3      4.858342e+06
4      5.430102e+06
           ...
995    6.279603e+06
996    5.301939e+06
997    5.971516e+06
998    6.138559e+06
999    5.090248e+06
Name: date, Length: 1000, dtype: float64

In [144]:
# in hours

(today - df_time['date'])/np.timedelta64(1,'h')

0       89324.053443
1       86061.220109
2       97724.536776
3       80972.370109
4       90501.703443
           ...
995    104660.053443
996     88365.653443
997     99525.270109
998    102309.320109
999     84837.470109
Name: date, Length: 1000, dtype: float64